"""
Пользователь вводит длину и ширину плитки шоколада, а также размер куска,
который хочет отломить, программа должна вычислить - можно ли совершить
подобный разлом или нет, если учесть, что ломать можно только по прямой.

Пример:
    3, 4, 6 -> True
    5, 7, 8 -> False
    4, 5, 12 -> True
"""

print('Введите длину шоколадки:')
length = int(input())

print('Введите ширину шоколадки:')
width = int(input())

print('Введите размер куска, который нужно отломить:')
size = int(input())

print(f'{length}, {width}, {size} -> {size % length == 0 or size % width == 0}')
