"""
Пользователь в бесконечном цикле вводит данные пользователей: имя, затем фамилию, возраст и ID.

Ввод продолжается до тех пор, пока не будет введено пустое поле. Пользователи заносятся в словарь,
где ключ это ID пользователя, а остальные данные записываются в виде кортежа.

Так же программа должна проверять, что:
    * имя и фамилия состоят только из символов и начинаются с большой буквы,
        если не с большой, то заменяет на большую
    * возраст должен быть числом от 18 до 60
    * ID - целое число, дополненное нулями до 8 знаков, ID должен быть уникальным

Дополнительно написать функцию, которая будет выводить полученный словарь в виде таблицы.
"""
